openFoamFiles/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Dab           [0 2 -1 0 0 0 0]    2.0e-5;//1.79e-6;
alphatab      [0 0 0 0 0 0 0]     1.25;//1;

phases (water air);

water
{
    transportModel  Newtonian;
    nu              1.79e-6;//7.2e-06;
    rho             1024;
}

air
{
    transportModel  Newtonian;
    nu              1.79e-6;//7.2e-06;7.2e-06;
    rho             997;
}

sigma           0.0;//10;//0.0;//0.07;


// ************************************************************************* //
