openFoamFiles/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  5                                     | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       volScalarField; 
    location     "0"; 
    object      k; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
 
 
dimensions      [0 2 -2 0 0 0 0]; 
 
internalField   uniform 0.000024; 
 
boundaryField 
{ 
    //- Set patchGroups for constraint patches 
    #includeEtc "caseDicts/setConstraintTypes" 
    inlet 
    { 
        type            fixedValue; 
        value           $internalField;
    } 
    outlet 
    { 
       type            inletOutlet; 
       inletValue      $internalField;
       value           $internalField;
    } 
    atmosphere 
	{ 
		type			zeroGradient;
	} 
    atmosphereFrontOfBarge 
	{ 
		type			zeroGradient;
	} 
	barge 
	{ 
        type            kqRWallFunction;//kLowReWallFunction;
        value           $internalField;

   } 
} 
 
// ************************************************************************* // 
