openFoamFiles/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
	/* 
   "alpha.water.*"
    {
        nAlphaSubCycles     2;
        nAlphaCorr          1;

        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-9;
        relTol          0;
        nSweeps         1;
    }
	*/

    "alpha.water.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 2;
        cAlpha          1;
        icAlpha         0; //from dtcHull


        MULESCorr       yes;
        nLimiterIter    10;
        alphaApplyPrevCorr  yes;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }


    p_rgh
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    "(U|k|omega).*"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
        nSweeps         1;
    }

    "(UFinal|kFinal|omegaFinal).*"
    {
        $U;
        relTol          0;

        $k;
        relTol          0;

        $omega;
        relTol          0;

    }
}

PIMPLE
{
    momentumPredictor   no;//yes; It is yes in tutorial
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;

    pRefValue           0;
    pRefPoint           (0.0 0.0 -0.2);// Originally (0.1 0.1 1);

	// Toby pimple https://openfoamwiki.net/index.php/OpenFOAM_guide/The_PIMPLE_algorithm_in_OpenFOAM
	/*	
	residualControl
    {
    	U
        {
                tolerance  1e-5;
                relTol      0;
        }
        p_rgh
        {
                tolerance  5e-4;
                relTol      0;
        }
     }
	*/
}

/*relaxationFactors
{
    fields
    {
        p_rgh      0.3;
        p_rghFinal   1;
    }
    equations
    {
        "U|k|omega"     0.3;
        "(U|k|omega)Final"   1;
    }
}
*/


// ************************************************************************* //
