openFoamFiles/Allrun.post
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication -s yPlus \
    interFoam  -postProcess -func yPlus

#runApplication -s wallShearStress 
#	simpleFoam -postProcess -func wallShearStress

#runApplication -s sample \
#	simpleFoam -postProcess -func sample -latestTime



